<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	
	<!-- 
		* 프레임워크
		- 개발자가 보다 편리한 환경에서 개발할 수 있도록 제공하는 뼈대, 틀
		- 소프트웨어 개발의 입장으로써는 공통으로 사용하는 라이브러리/ 개발도구 / 인터페이스 등등을 의미한다.
		
		* 사용하는 이유?
		- 거대하고 복잡도가 높은 프로젝트를 완성시키기 위해서는 많은 사람이 필요한데
		  그 많은 개발자들이 "통일성"있고 빠르고 안정적으로 개발하기 위해서는 프레임워크가 필요하기 때문이다.
		
		* 프레임워크 특징
		- 자유롭게 설계하고 코딩하는 것이 아니라 프레임워크가 제공하는 가이드대로 설계해야 한다.
		- 개발범위가 정해져 있다.
		- 개발자를 위한 다양한 플로그인들이 지원된다.
		
		* 프레임워크 장단점
		> 장점 : 개발시간을 단축할 수 있다.
			    오류로 부터 자유로워질 수 있다.
		> 단점 : 의존하다보면 개발능력이 떨어져서 프레임워크 없이 개발하는 것이 어렵다.
				습득까지 시간이 오래걸릴 수 있다.
		
	 -->
	
	
	<jsp:forward page="WEB-INF/views/main.jsp"></jsp:forward>
	
	
	
	
	
	
	
	
	
	
	
	
	
	
</body>
</html>